PassengerId & Ticket - don't add value to the prediction since they are unique identification values

Pclass - important ordinal attribute

Fare - important ordinal attribute

Name - we could infer new attributes from 'Mr', 'Mrs', 'Miss', 'Master' (see other values)

Sex - nominal

Age - quantitative

SibSp - # of siblings/spouse

Parch - # of parents/childrens

Cabin - cabin type: to exclude since ~80% empty

Embarked - port of embarcation

Survived - to predict

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [2]:
def summary_missing_data(data):
    total = data.isnull().sum().sort_values(ascending=False)
    percent = (data.isnull().sum()/data.isnull().count()).sort_values(ascending=False)
    missing_data = pd.concat([total, percent], axis=1, keys=['# of Missing', 'Percent'])
    return missing_data

In [3]:
raw = pd.read_csv('./data/train.csv')
rawt = pd.read_csv('./data/test.csv')

In [4]:
raw.shape, rawt.shape

((891, 12), (418, 11))

In [5]:
raw.shape[0] + rawt.shape[0]

1309

In [6]:
brk = raw.shape[0]
data_cleaner = pd.concat([raw.copy(), rawt.copy()], ignore_index=True)
data_cleaner.shape

(1309, 12)

In [7]:
data_cleaner.iloc[brk-2:brk+2, :]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
889,26.0,C148,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1.0,111369
890,32.0,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0.0,370376
891,34.5,NaN,Q,7.8292,"Kelly, Mr. James",0,892,3,male,0,NaN,330911
892,47.0,NaN,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,893,3,female,1,NaN,363272

In [8]:
summary_missing_data(data_cleaner.drop(columns=['Survived'])).head(6)

          # of Missing   Percent
Cabin             1014  0.774637
Age                263  0.200917
Embarked             2  0.001528
Fare                 1  0.000764
Ticket               0  0.000000
SibSp                0  0.000000

# Attributes that don't add value to our predictor
- **PassengerId** and **Ticket** don't add value to the prediction since they are unique identification values
- **Cabin** to exclude since ~80% empty

In [9]:
data_cleaner = data_cleaner.drop(columns=['Cabin', 'Ticket'])

# Missing values

- How to deal with **Age**?
    - Fill mode? median by groups?
    
    
- Who are the ones with no **Embarked** and **Fare**?
    - Decide what to do
    - Fill the **Embarked** and **Fare** type of other similar persons (by age? parch? pclass?)

## Fill nulls with

In [10]:
fillers = {
    'Age': raw['Age'].mode()[0],
    'Embarked': raw['Embarked'].mode()[0],
    'Fare': raw['Fare'].mode()[0]
}
data_cleaner = data_cleaner.fillna(fillers)
summary_missing_data( data_cleaner.drop(columns=['Survived']) ).head()

             # of Missing  Percent
SibSp                   0      0.0
Sex                     0      0.0
Pclass                  0      0.0
PassengerId             0      0.0
Parch                   0      0.0

## Identify from the **Name** meaningful socio-economic status as 'Mr', 'Mrs', 'Dr', 'Master', etc appears. Do OneHot encoder on them, then delete column Name

In [11]:
titles = []
for n in data_cleaner['Name']:
    s = n.split(',')
    status = s[1].split('.')
    titles.append(status[0].strip())
titles = list(set(titles))
titles

['Major',
 'Mme',
 'Dona',
 'Col',
 'Ms',
 'the Countess',
 'Lady',
 'Sir',
 'Rev',
 'Miss',
 'Capt',
 'Master',
 'Jonkheer',
 'Mrs',
 'Mr',
 'Mlle',
 'Dr',
 'Don']

In [12]:
titles_encoded = []
for a_title in titles:
    titles_encoded.append(pd.DataFrame([ 1 if n.find(a_title+'.') >= 0 else 0 for n in data_cleaner['Name'] ], columns=[a_title]))

In [13]:
datasetdummy = pd.concat([data_cleaner, *titles_encoded], axis=1)
datasetdummy = datasetdummy.drop(columns=['Name'])
datasetdummy.shape

(1309, 27)

In [14]:
datasetdummy.head(5)

,Age,Embarked,Fare,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Major,...,Rev,Miss,Capt,Master,Jonkheer,Mrs,Mr,Mlle,Dr,Don
0,22.0,S,7.2500,0,1,3,male,1,0.0,0,...,0,0,0,0,0,0,1,0,0,0
1,38.0,C,71.2833,0,2,1,female,1,1.0,0,...,0,0,0,0,0,1,0,0,0,0
2,26.0,S,7.9250,0,3,3,female,0,1.0,0,...,0,1,0,0,0,0,0,0,0,0
3,35.0,S,53.1000,0,4,1,female,1,1.0,0,...,0,0,0,0,0,1,0,0,0,0
4,35.0,S,8.0500,0,5,3,male,0,0.0,0,...,0,0,0,0,0,0,1,0,0,0

In [15]:
datasetdummy = pd.get_dummies(datasetdummy, columns=['Embarked', 'Sex'])

In [16]:
summary_missing_data(datasetdummy.drop(columns=['Survived'])).head(6)

             # of Missing  Percent
Sex_male                0      0.0
Sir                     0      0.0
Fare                    0      0.0
Parch                   0      0.0
PassengerId             0      0.0
Pclass                  0      0.0

In [17]:
datasetdummy.iloc[brk-2:brk+2, :].head()

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived,Major,Mme,Dona,...,Mrs,Mr,Mlle,Dr,Don,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
889,26.0,30.0000,0,890,1,0,1.0,0,0,0,...,0,1,0,0,0,1,0,0,0,1
890,32.0,7.7500,0,891,3,0,0.0,0,0,0,...,0,1,0,0,0,0,1,0,0,1
891,34.5,7.8292,0,892,3,0,NaN,0,0,0,...,0,1,0,0,0,0,1,0,0,1
892,47.0,7.0000,0,893,3,1,NaN,0,0,0,...,1,0,0,0,0,0,0,1,1,0

In [18]:
print('Train shape \t\t{}'.format(raw.shape))
print('Test shape \t\t{}'.format(rawt.shape))
# print('Combined Raw shape \t{}'.format(rawfull.shape))
print('Dummy shape \t\t{}'.format(datasetdummy.shape))

Train shape 		(891, 12)
Test shape 		(418, 11)
Dummy shape 		(1309, 30)

## Split training and test set and save

In [19]:
datatrain = datasetdummy.iloc[0:brk,:]
datatrain.shape

(891, 30)

In [22]:
datatest = datasetdummy.iloc[brk:,:]
datatest = datatest.drop(columns=['Survived'])
datatest.shape

(418, 29)

## Save output file

In [21]:
datatrain.to_csv('cl_train.csv', index=False)
datatest.to_csv('cl_test.csv', index=False)